import os

from django.core.management.base import BaseCommand  
from ...models import Audio

class Command(BaseCommand):

	def handle(self, *args, **options):
		audioInfo = [
			[1, 'cantonese_141015_367259-15', '256662351261323423115414'],
			[2, 'cantonese_140927_363450-6', '3366255344362253126114436'],
			[3, 'cantonese_140916_361200-30', '21535636144362463323136516'],
			[4, 'cantonese_140927_363450-5', '444214614163556266422313'],
			[5, 'cantonese_140916_361200-13', '636354115362641631651241442'],
			[6, 'cantonese_140916_361200-22', '146331626253131425214451'],
			[7, 'cantonese_140925_363090-6', '364244156135441145351266'],
			[8, 'cantonese_140926_363178-21', '44541163263264363256112'],
			[9, 'cantonese_140926_363298-6', '1634343245631233564631'],
			[10, 'cantonese_140927_363450-1', '643446135363425514113642'],
			[11, 'cantonese_140927_363450-24', '126546313215264344113'],
			[12, 'cantonese_141015_367259-23', '43411561341145244266561312'],
			[13, 'cantonese_141015_367263-11', '111111111111111111111111111'],
			[14, 'cantonese_141007_365536-7', '11111111111111111111111111111'],
			[15, 'cantonese_140917_361368-5', '11111111111111111111111111'],
			[16, 'cantonese_140916_361202-21', '11111111111111111111111111'],
			[17, 'cantonese_140916_361200-24', '11111111111111111111111111'],
			[18, 'cantonese_141004_365076-8', '111111111111111111111111'],
		]

		for i in audioInfo:
			Audio.objects.update_or_create(
				id = i[0],
					defaults={
					'fileName' : i[1],
					'numSegments' : len(i[2]),
					'answer' : i[2],
				}
			)


# 1
# 2
# 3
# 4
# 5
# 6
# 7
# 8 同埋旅游三方面㗎保育协会认为呀负责管理地质公园
# 9 之后嘅时间人数可能会达到三位数㗎佢地强调呀将
# 10 达成嘅重行定居协议正被扣留喺鲁鲁机留中心嘅难民可
# 11 亿此外佢强调澳洲政府将会喺未来四年提供多四
# 12 馀嘅时间当佢外出嘅时候要由父母陪同噉另外佢亦都要遵守